002_cylinder2D_base/pimpleFoam/Allrun
#!/bin/bash

decomposePar
mpirun -np 4 pimpleFoam -parallel > log.pimpleFoam 
reconstructPar
rm -r processor*