002_cylinder2D_base/pimpleFoam/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forces
{
    type            forceCoeffs;
    libs            (forces);
    writeControl    timeStep;
    writeInterval   1;

    patches         ("hole");
    rho             rhoInf;  // Indicates incompressible
    log             true;
    rhoInf          1;       // Required when rho = rhoInf
    liftDir         (0 1 0);
    dragDir         (1 0 0);
    CofR            (0 0 0); // Axle midpoint on ground
    pitchAxis       (0 0 1);
    magUInf         0.15;    // Freestream velocity magnitude [m/s]
    lRef            0.02;    // Reference length [m]
    Aref            0.0002;  // Reference area [m2]
}


// ************************************************************************* //
