002_cylinder2D_base/pimpleFoam/system/pressureCoefficient
pressureCoefficient1
{
    type            pressure;
    libs            (fieldFunctionObjects);

    mode            staticCoeff;

    result          cp;

    rho             rhoInf;
    rhoInf          1.2;
    pInf            0;
    UInf            (0.15 0 0);

    // Inherited entries
    writeControl    writeTime;
}
